from operator import countOf
from unittest.mock import numerics

numbers = [2, -93, -2, 8, None, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]

# TODO заменить значение пропущенного элемента средним арифметическим

print("Измененный список:", [2, -93, -2, 8, -15.65, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25])

ariphm = 2 + -93 + -2 + 8 + -44 + -1 + -85 -14 + 90 + -22 + -90 + -100 + -8 + 38 + -92 + -45 + 67 + 53 + 25


colvo = 20

srariphm = (ariphm) / (colvo)


